In [56]:
import pandas as pd
import numpy as np

In [57]:
obj=pd.Series([1,2,3,4],index=['a','b','c','d'])
obj

a    1
b    2
c    3
d    4
dtype: int64

In [58]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [59]:
obj2.drop('e')

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [60]:
frame1=pd.DataFrame(index=['a','b','c','d'],columns=['data','data1','data2','data3'])
frame1

  data data1 data2 data3
a  NaN   NaN   NaN   NaN
b  NaN   NaN   NaN   NaN
c  NaN   NaN   NaN   NaN
d  NaN   NaN   NaN   NaN

In [61]:
frame1=pd.DataFrame(np.arange(16).reshape((-1,4)),index=['a','b','c','d'],columns=['data','data1','data2','data3'])
frame1

   data  data1  data2  data3
a     0      1      2      3
b     4      5      6      7
c     8      9     10     11
d    12     13     14     15

In [62]:
frame=pd.DataFrame(np.arange(9).reshape((-1, 3)),index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
# Create data Frame with NUmpy

data = pd.DataFrame(np.arange(16).reshape((-1, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
#Drop the row
data.drop('Colorado')

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data.drop('one',axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [66]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [67]:
obj3=pd.Series(np.arange(4),index=['a','b','c','d'])
obj3

a    0
b    1
c    2
d    3
dtype: int32

In [68]:
obj3['b']

1

In [69]:
obj3[[2]]

c    2
dtype: int32

In [70]:
# Change the values in a Series
obj3['b':'c']=5,7
obj3

a    0
b    5
c    7
d    3
dtype: int32

In [71]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [72]:
data[data['three'] > 0]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.one

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [74]:
# Adding the column

data['five']=11,22,33,44
data

          one  two  three  four  five
Ohio        0    1      2     3    11
Colorado    4    5      6     7    22
Utah        8    9     10    11    33
New York   12   13     14    15    44

In [75]:
# Delete data col

del(data['five'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
# loc we need to find the exactdata position

data.loc['Utah',['one']]

one    8
Name: Utah, dtype: int32

In [80]:
# iloc 

# find the row position

data.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [83]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
# find the data based on cols & rows
data.iloc[1:,:3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [96]:
data.iloc[1:,:3][data.three>5]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [97]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [98]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [99]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [100]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [117]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [118]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [119]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [120]:
df3=df1-df2
df3

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [121]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [122]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [127]:
df4=df3.fillna(method='ffill',axis=1).fillna(5)
df4

     a    b    c    d    e
0  0.0  0.0  0.0  0.0  0.0
1 -1.0 -1.0 -1.0 -1.0 -1.0
2 -2.0 -2.0 -2.0 -2.0 -2.0
3  5.0  5.0  5.0  5.0  5.0

In [129]:
df4.notnull().sum()

a    4
b    4
c    4
d    4
e    4
dtype: int64

## Another Day

In [130]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [132]:
# Count the data how many one, tow,three & four

data.count()

one      4
two      4
three    4
four     4
dtype: int64

In [133]:
data.count(axis='rows')

one      4
two      4
three    4
four     4
dtype: int64

In [134]:
data.count(axis='columns')

Ohio        4
Colorado    4
Utah        4
New York    4
dtype: int64

In [135]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [146]:
data.loc['Colorado','two']=np.nan
data

           one   two  three  four
Ohio       0.0   1.0    2.0   3.0
Colorado   4.0   NaN    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0
1          NaN   NaN    NaN   NaN

In [147]:
# If nan is available that place only contains True
pd.isna(data)

            one    two  three   four
Ohio      False  False  False  False
Colorado  False   True  False  False
Utah      False  False  False  False
New York  False  False  False  False
1          True   True   True   True

In [148]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [149]:
frame.sort_index()

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [150]:
#Sort the column indexes

frame.sort_index(axis=1)

   California  Ohio  Texas
a           2     0      1
c           5     3      4
d           8     6      7

In [151]:
data

           one   two  three  four
Ohio       0.0   1.0    2.0   3.0
Colorado   4.0   NaN    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0
1          NaN   NaN    NaN   NaN